node {
  name: "alpha/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "alpha"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "alpha/Assign"
  op: "Assign"
  input: "alpha"
  input: "alpha/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@alpha"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "alpha/read"
  op: "Identity"
  input: "alpha"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@alpha"
      }
    }
  }
}
node {
  name: "gModel_0/input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 32
        }
        dim {
          size: 128
        }
        dim {
          size: 128
        }
        dim {
          size: 4
        }
      }
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/lambda_1/MirrorPad/paddings"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 5
          }
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\001\000\000\000\001\000\000\000\001\000\000\000\001\000\000\000\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/lambda_1/MirrorPad"
  op: "MirrorPad"
  input: "gModel_0/input"
  input: "gModel_0/gLEnc_128to64/lambda_1/MirrorPad/paddings"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tpaddings"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "mode"
    value {
      s: "SYMMETRIC"
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/lambda_1/Placeholder"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 32
        }
        dim {
          size: 128
        }
        dim {
          size: 128
        }
        dim {
          size: 4
        }
      }
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/lambda_1/MirrorPad_1/paddings"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 5
          }
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\001\000\000\000\001\000\000\000\001\000\000\000\001\000\000\000\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/lambda_1/MirrorPad_1"
  op: "MirrorPad"
  input: "gModel_0/gLEnc_128to64/lambda_1/Placeholder"
  input: "gModel_0/gLEnc_128to64/lambda_1/MirrorPad_1/paddings"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tpaddings"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "mode"
    value {
      s: "SYMMETRIC"
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/lambda_2/Reshape/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\377\377\377\377\202\000\000\000\202\000\000\000\004\000\000\000"
      }
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/lambda_2/Reshape"
  op: "Reshape"
  input: "gModel_0/gLEnc_128to64/lambda_1/MirrorPad"
  input: "gModel_0/gLEnc_128to64/lambda_2/Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/lambda_2/Placeholder"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 32
        }
        dim {
          size: 130
        }
        dim {
          size: 130
        }
        dim {
          size: 4
        }
      }
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/lambda_2/Reshape_1/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\377\377\377\377\202\000\000\000\202\000\000\000\004\000\000\000"
      }
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/lambda_2/Reshape_1"
  op: "Reshape"
  input: "gModel_0/gLEnc_128to64/lambda_2/Placeholder"
  input: "gModel_0/gLEnc_128to64/lambda_2/Reshape_1/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/conv2d_1/truncated_normal/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000\004\000\000\000 \000\000\000"
      }
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/conv2d_1/truncated_normal/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/conv2d_1/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2679574489593506
      }
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/conv2d_1/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "gModel_0/gLEnc_128to64/conv2d_1/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 2747207
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/conv2d_1/truncated_normal/mul"
  op: "Mul"
  input: "gModel_0/gLEnc_128to64/conv2d_1/truncated_normal/TruncatedNormal"
  input: "gModel_0/gLEnc_128to64/conv2d_1/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/conv2d_1/truncated_normal"
  op: "Add"
  input: "gModel_0/gLEnc_128to64/conv2d_1/truncated_normal/mul"
  input: "gModel_0/gLEnc_128to64/conv2d_1/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/conv2d_1/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 4
        }
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/conv2d_1/kernel/Assign"
  op: "Assign"
  input: "gModel_0/gLEnc_128to64/conv2d_1/kernel"
  input: "gModel_0/gLEnc_128to64/conv2d_1/truncated_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@gModel_0/gLEnc_128to64/conv2d_1/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/conv2d_1/kernel/read"
  op: "Identity"
  input: "gModel_0/gLEnc_128to64/conv2d_1/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@gModel_0/gLEnc_128to64/conv2d_1/kernel"
      }
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/conv2d_1/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/conv2d_1/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/conv2d_1/bias/Assign"
  op: "Assign"
  input: "gModel_0/gLEnc_128to64/conv2d_1/bias"
  input: "gModel_0/gLEnc_128to64/conv2d_1/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@gModel_0/gLEnc_128to64/conv2d_1/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/conv2d_1/bias/read"
  op: "Identity"
  input: "gModel_0/gLEnc_128to64/conv2d_1/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@gModel_0/gLEnc_128to64/conv2d_1/bias"
      }
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/conv2d_1/convolution/dilation_rate"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/conv2d_1/convolution"
  op: "Conv2D"
  input: "gModel_0/gLEnc_128to64/lambda_2/Reshape"
  input: "gModel_0/gLEnc_128to64/conv2d_1/kernel/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/conv2d_1/BiasAdd"
  op: "BiasAdd"
  input: "gModel_0/gLEnc_128to64/conv2d_1/convolution"
  input: "gModel_0/gLEnc_128to64/conv2d_1/bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/lambda_3/Reshape/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 5
          }
        }
        tensor_content: "\377\377\377\377 \000\000\000\200\000\000\000\200\000\000\000 \000\000\000"
      }
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/lambda_3/Reshape"
  op: "Reshape"
  input: "gModel_0/gLEnc_128to64/conv2d_1/BiasAdd"
  input: "gModel_0/gLEnc_128to64/lambda_3/Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/lambda_3/Placeholder"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
        dim {
          size: 128
        }
        dim {
          size: 128
        }
        dim {
          size: 32
        }
      }
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/lambda_3/Reshape_1/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 5
          }
        }
        tensor_content: "\377\377\377\377 \000\000\000\200\000\000\000\200\000\000\000 \000\000\000"
      }
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/lambda_3/Reshape_1"
  op: "Reshape"
  input: "gModel_0/gLEnc_128to64/lambda_3/Placeholder"
  input: "gModel_0/gLEnc_128to64/lambda_3/Reshape_1/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/elu_1/Elu"
  op: "Elu"
  input: "gModel_0/gLEnc_128to64/lambda_3/Reshape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/lambda_4/MirrorPad/paddings"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 5
          }
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\001\000\000\000\001\000\000\000\001\000\000\000\001\000\000\000\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/lambda_4/MirrorPad"
  op: "MirrorPad"
  input: "gModel_0/gLEnc_128to64/elu_1/Elu"
  input: "gModel_0/gLEnc_128to64/lambda_4/MirrorPad/paddings"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tpaddings"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "mode"
    value {
      s: "SYMMETRIC"
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/lambda_4/Placeholder"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 32
        }
        dim {
          size: 128
        }
        dim {
          size: 128
        }
        dim {
          size: 32
        }
      }
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/lambda_4/MirrorPad_1/paddings"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 5
          }
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\001\000\000\000\001\000\000\000\001\000\000\000\001\000\000\000\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/lambda_4/MirrorPad_1"
  op: "MirrorPad"
  input: "gModel_0/gLEnc_128to64/lambda_4/Placeholder"
  input: "gModel_0/gLEnc_128to64/lambda_4/MirrorPad_1/paddings"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tpaddings"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "mode"
    value {
      s: "SYMMETRIC"
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/lambda_5/Reshape/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\377\377\377\377\202\000\000\000\202\000\000\000 \000\000\000"
      }
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/lambda_5/Reshape"
  op: "Reshape"
  input: "gModel_0/gLEnc_128to64/lambda_4/MirrorPad"
  input: "gModel_0/gLEnc_128to64/lambda_5/Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/lambda_5/Placeholder"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 32
        }
        dim {
          size: 130
        }
        dim {
          size: 130
        }
        dim {
          size: 32
        }
      }
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/lambda_5/Reshape_1/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\377\377\377\377\202\000\000\000\202\000\000\000 \000\000\000"
      }
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/lambda_5/Reshape_1"
  op: "Reshape"
  input: "gModel_0/gLEnc_128to64/lambda_5/Placeholder"
  input: "gModel_0/gLEnc_128to64/lambda_5/Reshape_1/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/conv2d_2/truncated_normal/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000 \000\000\000 \000\000\000"
      }
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/conv2d_2/truncated_normal/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/conv2d_2/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.09473726898431778
      }
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/conv2d_2/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "gModel_0/gLEnc_128to64/conv2d_2/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 604721
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/conv2d_2/truncated_normal/mul"
  op: "Mul"
  input: "gModel_0/gLEnc_128to64/conv2d_2/truncated_normal/TruncatedNormal"
  input: "gModel_0/gLEnc_128to64/conv2d_2/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/conv2d_2/truncated_normal"
  op: "Add"
  input: "gModel_0/gLEnc_128to64/conv2d_2/truncated_normal/mul"
  input: "gModel_0/gLEnc_128to64/conv2d_2/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/conv2d_2/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 32
        }
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/conv2d_2/kernel/Assign"
  op: "Assign"
  input: "gModel_0/gLEnc_128to64/conv2d_2/kernel"
  input: "gModel_0/gLEnc_128to64/conv2d_2/truncated_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@gModel_0/gLEnc_128to64/conv2d_2/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/conv2d_2/kernel/read"
  op: "Identity"
  input: "gModel_0/gLEnc_128to64/conv2d_2/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@gModel_0/gLEnc_128to64/conv2d_2/kernel"
      }
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/conv2d_2/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/conv2d_2/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/conv2d_2/bias/Assign"
  op: "Assign"
  input: "gModel_0/gLEnc_128to64/conv2d_2/bias"
  input: "gModel_0/gLEnc_128to64/conv2d_2/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@gModel_0/gLEnc_128to64/conv2d_2/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/conv2d_2/bias/read"
  op: "Identity"
  input: "gModel_0/gLEnc_128to64/conv2d_2/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@gModel_0/gLEnc_128to64/conv2d_2/bias"
      }
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/conv2d_2/convolution/dilation_rate"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/conv2d_2/convolution"
  op: "Conv2D"
  input: "gModel_0/gLEnc_128to64/lambda_5/Reshape"
  input: "gModel_0/gLEnc_128to64/conv2d_2/kernel/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/conv2d_2/BiasAdd"
  op: "BiasAdd"
  input: "gModel_0/gLEnc_128to64/conv2d_2/convolution"
  input: "gModel_0/gLEnc_128to64/conv2d_2/bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/lambda_6/Reshape/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 5
          }
        }
        tensor_content: "\377\377\377\377 \000\000\000@\000\000\000@\000\000\000 \000\000\000"
      }
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/lambda_6/Reshape"
  op: "Reshape"
  input: "gModel_0/gLEnc_128to64/conv2d_2/BiasAdd"
  input: "gModel_0/gLEnc_128to64/lambda_6/Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/lambda_6/Placeholder"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
        dim {
          size: 64
        }
        dim {
          size: 64
        }
        dim {
          size: 32
        }
      }
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/lambda_6/Reshape_1/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 5
          }
        }
        tensor_content: "\377\377\377\377 \000\000\000@\000\000\000@\000\000\000 \000\000\000"
      }
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/lambda_6/Reshape_1"
  op: "Reshape"
  input: "gModel_0/gLEnc_128to64/lambda_6/Placeholder"
  input: "gModel_0/gLEnc_128to64/lambda_6/Reshape_1/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gModel_0/gLEnc_128to64/elu_2/Elu"
  op: "Elu"
  input: "gModel_0/gLEnc_128to64/lambda_6/Reshape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gModel_0/gLEnc_64to32/lambda_7/MirrorPad/paddings"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 5
          }
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\001\000\000\000\001\000\000\000\001\000\000\000\001\000\000\000\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "gModel_0/gLEnc_64to32/lambda_7/MirrorPad"
  op: "MirrorPad"
  input: "gModel_0/gLEnc_128to64/elu_2/Elu"
  input: "gModel_0/gLEnc_64to32/lambda_7/MirrorPad/paddings"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tpaddings"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "mode"
    value {
      s: "SYMMETRIC"
    }
  }
}
node {
  name: "gModel_0/gLEnc_64to32/lambda_7/Placeholder"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 32
        }
        dim {
          size: 64
        }
        dim {
          size: 64
        }
        dim {
          size: 32
        }
      }
    }
  }
}
node {
  name: "gModel_0/gLEnc_64to32/lambda_7/MirrorPad_1/paddings"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 5
          }
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\001\000\000\000\001\000\000\000\001\000\000\000\001\000\000\000\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "gModel_0/gLEnc_64to32/lambda_7/MirrorPad_1"
  op: "MirrorPad"
  input: "gModel_0/gLEnc_64to32/lambda_7/Placeholder"
  input: "gModel_0/gLEnc_64to32/lambda_7/MirrorPad_1/paddings"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tpaddings"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "mode"
    value {
      s: "SYMMETRIC"
    }
  }
}
node {
  name: "gModel_0/gLEnc_64to32/lambda_8/Reshape/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\377\377\377\377B\000\000\000B\000\000\000 \000\000\000"
      }
    }
  }
}
node {
  name: "gModel_0/gLEnc_64to32/lambda_8/Reshape"
  op: "Reshape"
  input: "gModel_0/gLEnc_64to32/lambda_7/MirrorPad"
  input: "gModel_0/gLEnc_64to32/lambda_8/Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gModel_0/gLEnc_64to32/lambda_8/Placeholder"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 32
        }
        dim {
          size: 66
        }
        dim {
          size: 66
        }
        dim {
          size: 32
        }
      }
    }
  }
}
node {
  name: "gModel_0/gLEnc_64to32/lambda_8/Reshape_1/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\377\377\377\377B\000\000\000B\000\000\000 \000\000\000"
      }
    }
  }
}
node {
  name: "gModel_0/gLEnc_64to32/lambda_8/Reshape_1"
  op: "Reshape"
  input: "gModel_0/gLEnc_64to32/lambda_8/Placeholder"
  input: "gModel_0/gLEnc_64to32/lambda_8/Reshape_1/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gModel_0/gLEnc_64to32/conv2d_3/truncated_normal/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000 \000\000\000@\000\000\000"
      }
    }
  }
}
node {
  name: "gModel_0/gLEnc_64to32/conv2d_3/truncated_normal/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "gModel_0/gLEnc_64to32/conv2d_3/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.09473726898431778
      }
    }
  }
}
node {
  name: "gModel_0/gLEnc_64to32/conv2d_3/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "gModel_0/gLEnc_64to32/conv2d_3/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 5284278
    }
  }
}
node {
  name: "gModel_0/gLEnc_64to32/conv2d_3/truncated_normal/mul"
  op: "Mul"
  input: "gModel_0/gLEnc_64to32/conv2d_3/truncated_normal/TruncatedNormal"
  input: "gModel_0/gLEnc_64to32/conv2d_3/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gModel_0/gLEnc_64to32/conv2d_3/truncated_normal"
  op: "Add"
  input: "gModel_0/gLEnc_64to32/conv2d_3/truncated_normal/mul"
  input: "gModel_0/gLEnc_64to32/conv2d_3/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gModel_0/gLEnc_64to32/conv2d_3/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 32
        }
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "gModel_0/gLEnc_64to32/conv2d_3/kernel/Assign"
  op: "Assign"
  input: "gModel_0/gLEnc_64to32/conv2d_3/kernel"
  input: "gModel_0/gLEnc_64to32/conv2d_3/truncated_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@gModel_0/gLEnc_64to32/conv2d_3/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "gModel_0/gLEnc_64to32/conv2d_3/kernel/read"
  op: "Identity"
  input: "gModel_0/gLEnc_64to32/conv2d_3/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@gModel_0/gLEnc_64to32/conv2d_3/kernel"
      }
    }
  }
}
node {
  name: "gModel_0/gLEnc_64to32/conv2d_3/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "gModel_0/gLEnc_64to32/conv2d_3/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "gModel_0/gLEnc_64to32/conv2d_3/bias/Assign"
  op: "Assign"
  input: "gModel_0/gLEnc_64to32/conv2d_3/bias"
  input: "gModel_0/gLEnc_64to32/conv2d_3/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@gModel_0/gLEnc_64to32/conv2d_3/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "gModel_0/gLEnc_64to32/conv2d_3/bias/read"
  op: "Identity"
  input: "gModel_0/gLEnc_64to32/conv2d_3/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@gModel_0/gLEnc_64to32/conv2d_3/bias"
      }
    }
  }
}
node {
  name: "gModel_0/gLEnc_64to32/conv2d_3/convolution/dilation_rate"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "gModel_0/gLEnc_64to32/conv2d_3/convolution"
  op: "Conv2D"
  input: "gModel_0/gLEnc_64to32/lambda_8/Reshape"
  input: "gModel_0/gLEnc_64to32/conv2d_3/kernel/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "gModel_0/gLEnc_64to32/conv2d_3/BiasAdd"
  op: "BiasAdd"
  input: "gModel_0/gLEnc_64to32/conv2d_3/convolution"
  input: "gModel_0/gLEnc_64to32/conv2d_3/bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "gModel_0/gLEnc_64to32/lambda_9/Reshape/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 5
          }
        }
        tensor_content: "\377\377\377\377 \000\000\000@\000\000\000@\000\000\000@\000\000\000"
      }
    }
  }
}
node {
  name: "gModel_0/gLEnc_64to32/lambda_9/Reshape"
  op: "Reshape"
  input: "gModel_0/gLEnc_64to32/conv2d_3/BiasAdd"
  input: "gModel_0/gLEnc_64to32/lambda_9/Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gModel_0/gLEnc_64to32/lambda_9/Placeholder"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
        dim {
          size: 64
        }
        dim {
          size: 64
        }
        dim {
          size: 64
        }
      }
    }
  }
}
node {
  name: "gModel_0/gLEnc_64to32/lambda_9/Reshape_1/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 5
          }
        }
        tensor_content: "\377\377\377\377 \000\000\000@\000\000\000@\000\000\000@\000\000\000"
      }
    }
  }
}
node {
  name: "gModel_0/gLEnc_64to32/lambda_9/Reshape_1"
  op: "Reshape"
  input: "gModel_0/gLEnc_64to32/lambda_9/Placeholder"
  input: "gModel_0/gLEnc_64to32/lambda_9/Reshape_1/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gModel_0/gLEnc_64to32/elu_3/Elu"
  op: "Elu"
  input: "gModel_0/gLEnc_64to32/lambda_9/Reshape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gModel_0/gLEnc_64to32/lambda_10/MirrorPad/paddings"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 5
          }
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\001\000\000\000\001\000\000\000\001\000\000\000\001\000\000\000\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "gModel_0/gLEnc_64to32/lambda_10/MirrorPad"
  op: "MirrorPad"
  input: "gModel_0/gLEnc_64to32/elu_3/Elu"
  input: "gModel_0/gLEnc_64to32/lambda_10/MirrorPad/paddings"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tpaddings"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "mode"
    value {
      s: "SYMMETRIC"
    }
  }
}
node {
  name: "gModel_0/gLEnc_64to32/lambda_10/Placeholder"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 32
        }
        dim {
          size: 64
        }
        dim {
          size: 64
        }
        dim {
          size: 64
        }
      }
    }
  }
}
node {
  name: "gModel_0/gLEnc_64to32/lambda_10/MirrorPad_1/paddings"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 5
          }
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\001\000\000\000\001\000\000\000\001\000\000\000\001\000\000\000\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "gModel_0/gLEnc_64to32/lambda_10/MirrorPad_1"
  op: "MirrorPad"
  input: "gModel_0/gLEnc_64to32/lambda_10/Placeholder"
  input: "gModel_0/gLEnc_64to32/lambda_10/MirrorPad_1/paddings"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tpaddings"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "mode"
    value {
      s: "SYMMETRIC"
    }
  }
}
node {
  name: "gModel_0/gLEnc_64to32/lambda_11/Reshape/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\377\377\377\377B\000\000\000B\000\000\000@\000\000\000"
      }
    }
  }
}
node {
  name: "gModel_0/gLEnc_64to32/lambda_11/Reshape"
  op: "Reshape"
  input: "gModel_0/gLEnc_64to32/lambda_10/MirrorPad"
  input: "gModel_0/gLEnc_64to32/lambda_11/Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gModel_0/gLEnc_64to32/lambda_11/Placeholder"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 32
        }
        dim {
          size: 66
        }
        dim {
          size: 66
        }
        dim {
          size: 64
        }
      }
    }
  }
}
node {
  name: "gModel_0/gLEnc_64to32/lambda_11/Reshape_1/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\377\377\377\377B\000\000\000B\000\000\000@\000\000\000"
      }
    }
  }
}
node {
  name: "gModel_0/gLEnc_64to32/lambda_11/Reshape_1"
  op: "Reshape"
  input: "gModel_0/gLEnc_64to32/lambda_11/Placeholder"
  input: "gModel_0/gLEnc_64to32/lambda_11/Reshape_1/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gModel_0/gLEnc_64to32/conv2d_4/truncated_normal/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000@\000\000\000@\000\000\000"
      }
    }
  }
}
node {
  name: "gModel_0/gLEnc_64to32/conv2d_4/truncated_normal/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "gModel_0/gLEnc_64to32/conv2d_4/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.06698936223983765
      }
    }
  }
}
node {
  name: "gModel_0/gLEnc_64to32/conv2d_4/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "gModel_0/gLEnc_64to32/conv2d_4/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 7220004
    }
  }
}
node {
  name: "gModel_0/gLEnc_64to32/conv2d_4/truncated_normal/mul"
  op: "Mul"
  input: "gModel_0/gLEnc_64to32/conv2d_4/truncated_normal/TruncatedNormal"
  input: "gModel_0/gLEnc_64to32/conv2d_4/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gModel_0/gLEnc_64to32/conv2d_4/truncated_normal"
  op: "Add"
  input: "gModel_0/gLEnc_64to32/conv2d_4/truncated_normal/mul"
  input: "gModel_0/gLEnc_64to32/conv2d_4/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gModel_0/gLEnc_64to32/conv2d_4/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 64
        }
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "gModel_0/gLEnc_64to32/conv2d_4/kernel/Assign"
  op: "Assign"
  input: "gModel_0/gLEnc_64to32/conv2d_4/kernel"
  input: "gModel_0/gLEnc_64to32/conv2d_4/truncated_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@gModel_0/gLEnc_64to32/conv2d_4/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "gModel_0/gLEnc_64to32/conv2d_4/kernel/read"
  op: "Identity"
  input: "gModel_0/gLEnc_64to32/conv2d_4/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@gModel_0/gLEnc_64to32/conv2d_4/kernel"
      }
    }
  }
}
node {
  name: "gModel_0/gLEnc_64to32/conv2d_4/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "gModel_0/gLEnc_64to32/conv2d_4/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "gModel_0/gLEnc_64to32/conv2d_4/bias/Assign"
  op: "Assign"
  input: "gModel_0/gLEnc_64to32/conv2d_4/bias"
  input: "gModel_0/gLEnc_64to32/conv2d_4/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@gModel_0/gLEnc_64to32/conv2d_4/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "gModel_0/gLEnc_64to32/conv2d_4/bias/read"
  op: "Identity"
  input: "gModel_0/gLEnc_64to32/conv2d_4/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@gModel_0/gLEnc_64to32/conv2d_4/bias"
      }
    }
  }
}
node {
  name: "gModel_0/gLEnc_64to32/conv2d_4/convolution/dilation_rate"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "gModel_0/gLEnc_64to32/conv2d_4/convolution"
  op: "Conv2D"
  input: "gModel_0/gLEnc_64to32/lambda_11/Reshape"
  input: "gModel_0/gLEnc_64to32/conv2d_4/kernel/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
